SOAP UI/01_Calculator_Demo_SOAP Project/TestSuite1__Postivie_workflow_-Subtract_TestCase-Subtract-0-FAILED.txt

Status: FAILED
Time Taken: 48371
Size: 0
Timestamp: Thu May 04 11:47:02 IST 2023
TestStep: Subtract

----------------- Messages ------------------------------
java.net.SocketException: Connection reset

----------------- Properties ------------------------------
Endpoint: http://www.dneonline.com/calculator.asmx
Encoding: UTF-8

---------------- Request ---------------------------
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Subtract>
         <tem:intA>50</tem:intA>
         <tem:intB>25</tem:intB>
      </tem:Subtract>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
- missing response / garbage collected -
